In [2]:
import pandas as pd

In [3]:
import numpy as np

In [5]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2['a']

-5

In [7]:
obj2[0]

4

In [9]:
obj2[obj2>0] # pandas와 numpy는 필터링이 기본적으로 내장되어 있다

d    4
b    7
c    3
dtype: int64

In [15]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
type(sdata)

dict

In [12]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [13]:
obj3['Ohio']

35000

In [14]:
'Ohio' in obj3

True

In [16]:
data = {
    'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
    'year':[2000,2001,2002,2001,2002],
    'pop':[1.5,1.7,3.6,2.4,2.9]
}
type(data)

dict

In [19]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [20]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [21]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [22]:
frame.describe()

             year       pop
count     5.00000  5.000000
mean   2001.20000  2.420000
std       0.83666  0.864292
min    2000.00000  1.500000
25%    2001.00000  1.700000
50%    2001.00000  2.400000
75%    2002.00000  2.900000
max    2002.00000  3.600000

In [35]:
frame.loc['two'] # 행 단위 접근 - for label based indexing

state    Ohio
year     2001
pop       1.7
Name: two, dtype: object

In [34]:
frame.iloc[1] # 행 단위 접근 - for positional indexing

state    Ohio
year     2001
pop       1.7
Name: two, dtype: object

In [26]:
frame.index = ['one','two','three','four','five']
frame

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9

In [41]:
frame2 = frame.copy()
frame2.drop(['one'])

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9

In [42]:
frame2 = frame.copy()
frame2.drop(['pop'], axis=1) # axis=0[디폴트 값]: 행 제거 / axis=1: 열 제거

        state  year
one      Ohio  2000
two      Ohio  2001
three    Ohio  2002
four   Nevada  2001
five   Nevada  2002

In [43]:
frame['two':'four']

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4

In [48]:
frame.loc[['two','four']]

       state  year  pop
two     Ohio  2001  1.7
four  Nevada  2001  2.4

In [53]:
frame[frame['pop']>2.3]

        state  year  pop
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9

In [50]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index = ['Ohio','Colorado','Utah','New York'],
                   columns = ['one','two','three','four'])

In [51]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [52]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
frame3 = pd.DataFrame(np.random.randn(4,3), columns=list('bde'),
                     index=['Utah','Ohio','Texas','Oregon'])
frame3

               b         d         e
Utah   -1.296589 -1.197824 -0.975111
Ohio   -0.987332 -2.052500 -0.184934
Texas  -0.663861  0.453962 -0.359825
Oregon -0.894969  1.108773 -2.259822

In [62]:
f = lambda x: x.max()-x.min()
frame3.apply(f) # 열 단위

b    0.632729
d    3.161274
e    2.074888
dtype: float64

In [64]:
frame3.apply(f, axis=1) # 행 단위

Utah      0.321478
Ohio      1.867566
Texas     1.117823
Oregon    3.368596
dtype: float64